backend/app/models/passenger.rb

  def self.search(search)
    if search
        passenger = Passenger.find_by(passport: search)
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."passport" = ? LIMIT ?  [["passport", "Z111"], ["LIMIT", 1]]