backend/app/controllers/flights_controller.rb

      def index
         fligths = Flight.all
---
SELECT "flights".* FROM "flights"

      def show
         flight = Flight.find_by(id: params[:id])
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]