backend/app/controllers/passengers_controller.rb

    def create

        @passenger = Passenger.new
        @passenger.firstname= params[:firstname]
        @passenger.lastname= params[:lastname]

        @passenger.passport= params[:passport]
        @passenger.save

        @seat = Seat.find_by_id(params[:seat_id])
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]