backend/app/controllers/passengers_controller.rb

SELECT "passengers".* FROM "passengers" WHERE "passengers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
    def show
        passenger = Passenger.find_by_id(10)

INSERT INTO "seats" ("flight_id", "seat_code", "passenger_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["flight_id", 32], ["seat_code", 7], ["passenger_id", 15], ["created_at", "2021-05-18 12:54:36.600188"], ["updated_at", "2021-05-18 12:54:36.600188"]]
---
    def create

        @passenger_id = Passenger.new
        @passenger.firstname= params[:firstname]
        @passenger.lastname= params[:lastname]
        Seat.create(flight_id: params[:flight_id], seat_code: params[:seat_code] , passenger_id: @ticket_id)