backend/app/controllers/passengers_controller.rb

      def index
        # passengers = Passenger.all

        passenger = Passenger.search(params[:passport])
---
SELECT "passengers".* FROM "passengers"

    def show
        passenger = Passenger.find_by(passport: params[:passport])
---
SELECT "passengers".* FROM "passengers" WHERE "passengers"."passport" IS NULL LIMIT ?  [["LIMIT", 1]]

    def create

        @passenger = Passenger.new
        @passenger.firstname= params[:firstname]
        @passenger.lastname= params[:lastname]
        @passenger.passport= params[:passport]
        @passenger.save
        @seat = Seat.find_by(flight_id: params[:flight_id],seat_code: params[:seat_code])

        @seat.passenger = @passenger
        @seat.save
---
INSERT INTO "passengers" ("firstname", "lastname", "passport", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstname", "Mere"], ["lastname", "Travin"], ["passport", "U0001"], ["created_at", "2021-05-18 12:54:36.592948"], ["updated_at", "2021-05-18 12:54:36.592948"]]
SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ? AND "seats"."seat_code" = ? LIMIT ?  [["flight_id", 32], ["seat_code", 7], ["LIMIT", 1]]
UPDATE "seats" SET "passenger_id" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["passenger_id", 17], ["updated_at", "2021-05-18 21:36:49.361826"], ["id", 87]]