backend/app/controllers/seats_controller.rb

    def update

        @seat = Seat.find_by(id: params[:seat_id])
        @seat.passenger_id = params[:passenger_id]
        @seat.save
---
SELECT "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 90], ["LIMIT", 1]]
UPDATE "seats" SET "passenger_id" = ?, "updated_at" = ? WHERE "seats"."id" = ?  [["passenger_id", 14], ["updated_at", "2021-05-18 19:40:32.852617"], ["id", 81]]