backend/app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats" WHERE "seats"."flight_id" = ? AND "seats"."seat_code" = ? LIMIT ?  [["flight_id", 32], ["seat_code", 6], ["LIMIT", 1]]
---
    def update

        @seat = Seat.find_by(flight_id: params[:flight_id],seat_code: params[:seat_code])